var brandsData = [{
  brand: "LuK",
  description: "以离合器命名的LuK致力于为全世界的车辆提供高品质的传动系统零部件。自成立初期为甲壳虫提供膜片弹簧离合器起，LuK就从未停止其创新的步伐，诸多跨时代的创新成果都成为市场上最受欢迎的产品。如今，全世界每四辆乘用车中就有一辆装配着LuK离合器，每两辆车中就有一辆使用LuK双质量飞轮。",
  products: [{
    name: "离合器套装",
    description: "LuK离合器系统维修的整体解决方案：将离合器从动盘、离合器压盘和分离轴承组成套装进行销售，是离合器系统的整体解决方案。确保所有部件的纯正原厂品质，并实现一次维修解决所有问题。"
  }, {
    name: "离合器压盘",
    description: "离合器压盘通过离合器从动盘将发动机的转矩传递到变速器输入轴。膜片弹簧式离合器替代了七十年代在汽车行业中使用的螺旋弹簧式离合器，给驾驶者带来了明显的舒适感，由于分离力很小，他们只需要施加很小的踏板力就可以了。 LuK膜片弹簧离合器的优点: 膜片弹簧可以承受高转速 膜片弹簧的理论寿命非常长 与螺旋弹簧离合器相比分离力更小（更舒适） 与螺旋弹簧离合器相比组成部件更少"
  }, {
    name: "离合器从动盘",
    description: "离合器从动盘是离合器的中心连接元件。它与离合器压盘总成组合在一起，既可以将发动机与动力传动系分离，也可以将二者接合起来。LuK针对不同的应用提供适当的解决方案，从带有简单扭转振减器的离合器从动盘到带有多级扭转减振器的离合器从动盘，从在双质量飞轮中使用的刚性离合器从动盘到带有径向偏差修正的离合器从动盘。 LuK离合器从动盘的优点： 愉快的驾驶舒适性 成本低、体积小的隔振装置 通过降低怠速转速减少油耗和废气排放 适用于狭小的空间 对发动机和变速器之间的角度或位置偏差进行补偿 采用优化的波形弹簧片和耐磨损的摩擦面材料延长使用寿命"
  }, {
    name: "分离轴承",
    description: "分离轴承连接发动机一侧的转动的离合器压盘总成和变速器一侧的固定分离机构，用于将分离力传递到离合器压盘总成。现代分离轴承由导向套筒为其导向，该导向套筒的法兰安装在变速器上。安装时，分离轴承的导向套筒随径向调节移动以确保膜片弹簧离合器的膜片弹簧指的最理想中心位置，这有助于防止膜片弹簧指区域出现磨损。 分离轴承在每次维修离合器时予以更换。 LuK分离轴承的优点： 长寿命 免维护（永久润滑）"
  }, {
    name: "液压分离轴承",
    description: "将离合器副缸与传统分离轴承结合，用于将分离力传递到离合器压盘总成。现在，每两台装有离合器的新车中就有一台配备液压分离轴承（即同轴副缸），这样可以将离合器副缸与传统分离轴承结合成一个零件。 液压分离轴承在每次维修离合器时予以更换。 LuK液压分离轴承的优点： 高度集成、运行安全、长寿命 结构紧凑 自动调节，补偿离合器磨损 高效率，低摩擦 踏板力低、磨损小 重量减轻 错误原因减少 不会因在螺栓上的液压载荷而产生牵引力"
  }, {
    name: "自调式离合器",
    description: "来自LuK的原创，1986年LuK是第一个将自调式离合器（SAC）推向市场的制造商。通过不间断地测量累积磨损造成的分离力增加，自调式离合器使用针对性的方式补偿摩擦面材料减少的厚度。"
  }, {
    name: "双质量飞轮",
    description: "LuK于上世纪80年代发明了极具创新意义的双质量飞轮产品，其配备的弹簧减振系统有效衰减传动系中的噪声和振动，大大提高了驾乘的舒适性，并可降低油耗。"
  }, {
    name: "转向助力泵",
    description: "LuK是欧洲领先的转向助力泵制造商之一。通过使用特殊的LuK节能泵等产品，可以减少最多达50%的能耗。LuK转向助力泵可以与其它泵组合，构成双朕泵。额外的叶片部件可以为柴油机预热或做为真空泵。 虽然转向助力泵的磨损非常小，但为确保无故障运行，必须维持正确的油位并定期检查连接以确保密封状况良好。"
  }, {
    name: "无级变速器",
    description: "无级变速器CVT不再使用传统的换挡程序，无限多的传动比确保发动机始终运行于最佳工况下，带来前所未有的驾驶舒适感。LuK无级变速器组件（链轮、链节式传动链和液压控制单元）代表了目前基于链条驱动原理的一流高性能CVT，可用于扭矩范围最高达380 Nm的强劲发动机。 优点： 无换挡冲击（即无需在不同传动比之间切换）带来极佳的驾驶舒适性 通过大传动比范围降低油耗 通过避免牵引力中断获得超强行驶动力 结构紧凑"
  }, {
    name: "离合器导套",
    description: "分离轴承导向套筒对于离合器的分离有非常大的影响。受损的分离轴承导向套筒会有这些明显症状：离合器接合过程延长、踏板迟钝并且有噪音。"
  }, {
    name: "离合器主缸",
    description: "也称为离合器总泵，是离合器液压式操作系统的机构，主要储存液体。LuK离合器主缸采用动态密封圈，无粘滑运动，无噪声，持久低摩擦。"
  }, {
    name: "卡圈",
    description: ""
  }, {
    name: "分离顶板",
    description: ""
  }]
}, {
  brand: "INA",
  description: "INA是全球众多顶级汽车和发动机制造商的原厂供应商，通过不断创新进取，为汽车售后维修领域带来诸多成就。作为发动机系统的专家，INA产品覆盖正时皮带传动系、链传动系、气门机构等各类发动机部件，其持久且精准的性能确保了发动机的每一次动力输出。",
  products: [{
    name: "水泵套装",
    description: "内含水泵，以及正时系统维修所需的张紧轮、张紧器、惰轮、正时皮带。整套更换时有利于系统运行效率更高、更耐用，有效降低返修率。"
  }, {
    name: "正时套装",
    description: "发动机保养的完整组件包，包含正时系统所需的张紧轮、张紧器、惰轮及正时皮带，还包括螺栓螺母、垫片等应当定期更换的五金件，以确保维修保养后正时系统及发动机能处于理想状态。"
  }, {
    name: "正时套装（不含皮带）",
    description: "除皮带之外的正时传动系统中所有易损部件的组合套装，保证产品匹配度最佳，有助于减少维修更换时寻找产品的时间，从而提高效率。"
  }, {
    name: "张紧轮",
    description: "具有自动张紧和阻尼功能，能确保张紧力始终合适，并可延长轮子的使用寿命，在减少噪音的同时提高驾驶舒适性。"
  }, {
    name: "惰轮",
    description: "INA惰轮采用特殊设计的ECO球轴承，配以高温润滑脂和相应的密封结构，保证性能稳定。"
  }, {
    name: "张紧器",
    description: "使正时皮带在传动过程中有合适的张紧力，确保正时传动系的正常工作，避免皮带打滑，或由于跳齿造成的发动机损坏。"
  }, {
    name: "正时皮带",
    description: "正时皮带是发动机配气系统的重要组成部分，通过与曲轴的连接并配合一定的传动比来保证进、排气时间的准确。"
  }, {
    name: "链传动系统部件",
    description: "INA提供的链传动部件包括链条、链张紧器、动轨、定轨以及链轮等产品，不但能确保精确的传动，而且耐磨性好，寿命长。"
  }, {
    name: "电磁阀OCV",
    description: "可变气门正时系统由电磁阀（OCV）和可变凸轮轴相位调节器（VCT）组成，通过调节发动机凸轮相位，使进气量可随发动机转速的变化而改变，从而达到最佳燃烧效率，提高燃油经济性。"
  }, {
    name: "可变凸轮相位调节器VCT",
    description: "可变气门正时系统由电磁阀（OCV）和可变凸轮轴相位调节器（VCT）组成，通过调节发动机凸轮相位，使进气量可随发动机转速的变化而改变，从而达到最佳燃烧效率，提高燃油经济性。"
  }, {
    name: "附件传动套装",
    description: "包含附件系统维修更换所需的张紧轮、张紧器及附件皮带等，以确保维修更换后附件系统能处于理想状态。"
  }, {
    name: "附件传动套装（不含皮带）",
    description: "除皮带之外的附件传动系统中所有易损部件的组合套装，保证产品匹配度最佳，有助于减少维修更换时寻找产品的时间，从而提高效率。"
  }, {
    name: "附件张紧器",
    description: "使附件皮带在传动过程中有合适的张紧力，确保附件传动系的正常工作，避免皮带打滑和皮带振动。"
  }, {
    name: "附件皮带",
    description: "用来驱动附属设备，如发电机、水泵、转向助力泵或空调压缩机等，需要定期更换。"
  }, {
    name: "发电机超越皮带轮",
    description: "发电机超越皮带轮能有效降低发电机对皮带传动系的干扰，使皮带传动更加平稳。INA为世界上超过1/5的汽车提供发电机超越皮带轮，能将发电机与曲轴的运动分离，降低发电机对皮带传动系的干扰，使皮带只能单向驱动发电机，工作更稳定。 INA发电机超越皮带轮的优点： 降低皮带上的引力和张紧单元的受力，减小张紧单元的工作范围 提高皮带传动件寿命 降低燃油消耗和噪音，并增加驾驶舒适性"
  }, {
    name: "气门挺杆套装",
    description: "系统性的维修解决方案，便于采购、运输和储存，避免产品浪费及损坏，现推出由6个进气、4个排气组成的套装，产品应用更清晰，避免由于应用错误导致的故障。"
  }, {
    name: "气门挺杆",
    description: "INA通过不断研发，现可提供满足所有气门机构类型应用要求的挺杆、摇臂、支撑件、转换阀，精密制造的INA气门挺杆能有效降低发动机的废气排放和噪声，优化舒适性，达到最佳性价比。"
  }, {
    name: "气门摇臂套装",
    description: "系统性的维修解决方案，便于采购、运输和储存，避免产品浪费及损坏，现推出适用于一组产品一次更换的套装，产品应用更清晰，避免由于应用错误导致的故障。"
  }, {
    name: "气门摇臂",
    description: "INA通过不断研发，现可提供满足所有气门机构类型应用要求的挺杆、摇臂、支撑件、转换阀，精密制造的INA气门摇臂能有效降低发动机的废气排放和噪声，延长发动机使用寿命。"
  }]
}, {
  brand: "FAG",
  description: "从1883年发明世界上的第一台球研磨机开始，FAG在滚动轴承领域以其无可比拟的辉煌成就推动着人类的前进。FAG不仅着眼于保障车辆行驶的安全，更立足于轴承技术的革新和优化 ，不断拖动汽车工业的发展。秉承其对于转动艺术的精心专研，FAG致力于提供高品质的轮毂轴承产品。",
  products: [{
    name: "轮毂轴承",
    description: "是汽车载重和转动的重要零部件，如出现故障会引起噪音、发热，甚至方向失控等危险状况。 FAG轮毂轴承以其卓越的安全性和稳定性闻名于世。尖端的技术和最优化的质量确保FAG轮毂轴承具有易安装、免维护、长寿命的特点， 3代产品更能可靠确保汽车安全设备系统中的ABS传感器和电磁脉冲发生器的正常工作。"
  }, {
    name: "轮毂轴承套装",
    description: "内含轮毂轴承以安装所需的其他零部件，是轮毂轴承维修安装的整体解决方案。FAG轮毂轴承以其卓越的安全性和稳定性闻名于世。尖端的技术和最优化的质量确保FAG轮毂轴承具有易安装、免维护、长寿命的特点。"
  }, {
    name: "悬架轴承",
    description: "FAG悬架轴承以麦弗逊式悬架构造设计而成，以起到独立支撑减震力和弹力的作用。 FAG悬架轴承的核心轴承组件采用全球两大轴承品牌INA和FAG，采用优化工艺，在耐用性和安全性上，拥有无可比拟的优势。"
  }, {
    name: "密封产品",
    description: "密封圈以及密封组件不仅用于轮毂轴承的修理，还可同时用于制动系统的维护。FAG为售后市场提供配套轮毂轴承使用的多种密封产品，确保轮毂轴承使用更顺畅。"
  }]
}, {
  brand: "Ruville",
  description: "路维（RUVILLE），这个拥有80多年历史的品牌对于中国汽车后市场的资深人士来说并不陌生，路维已经成为“国际品牌”和“质量可靠”的代名词。作为舍弗勒旗下享誉全球的品牌之一，如今路维首次将经典之作——水泵系列产品正式引入中国",
  products: []
}];


Meteor.startup(function() {
  if (Brands.find().count() === 0) {
    _.each(brandsData, function(brand) {
      Brands.insert(brand);
    });
  }
});
